def area(a, b): 
    """
    Функция вычисления площади с заданными сторонами a, b
    
    принимает параметр: a (int): первая сторона
                        b (int): вторая сторона
                        
    возвращает: площадь (int)
    """
    return a * b 

def perimeter(a, b): 
    """
    Функция вычисления периметра с заданными сторонами a, b
    
    принимает параметр: a (int): первая сторона
                        b (int): вторая сторона
                        
    возвращает: периметр (int)
    """
    return (a + b)*2