def area(a, h): 
    """
    Функция вычисления площади треугольника по стороне и высоте.

    Принимает параметры:
        a (int): сторона
        h (int): высота

    Возвращает:
        площадь (int)

    Пример вызова:
        area(4, 3) -> 6
    """
    return a * h / 2 

def perimeter(a, b, c): 
    """
    Функция вычисления периметра треугольника по трем сторонам.

    Принимает параметры:
        a (int): сторона 1
        b (int): сторона 2
        c (int): сторона 3

    Возвращает:
        периметр (int)

    Пример вызова:
        perimeter(3, 4, 5) -> 12
    """
    return a + b + c 